<?php
$str = 'Имя, Фамилия, email, mobile';

$arr = explode(',', $str);

echo "<pre>";
print_r($arr);
echo "</pre>";

$imp = implode(',',$arr);

echo $imp. "<br>";

// сериализация объектов и массивов


// serialize(); // кодирует, упаковывает
// unserialize(); // декодирует, распаковывает


$num = [11, 1231, 4132, 343];

$str2 = serialize($num);

echo $str2 . "<br>";

$str3 = unserialize($str2);

echo "<pre>";
print_r($str3);
echo "</pre>";

// JSON формат это процедура сериализации
// task serialize unserialize

$school = [
    'class A' => ['Емельянова Милана','Пирогова Алёна','Щербакова Аделина','Нестеров Борис','Коровин Максим','Андрианова Диана','Егорова София','Губанов Иван','Кузнецова София','Горшков Ярослав'],
    'class B' => ['Новиков Степан','Пирогова Алёна','Щербакова Аделина','Нестеров Борис','Коровин Максим','Андрианова Диана','Егорова София','Губанов Иван','Кузнецова София','Горшков Ярослав'],
    'class C' => ['Емельянова Милана','Пирогова Алёна','Щербакова Аделина','Нестеров Борис','Коровин Максим','Андрианова Диана','Егорова София','Губанов Иван','Кузнецова София','Горшков Ярослав'],
    'class D' => ['Емельянова Милана','Пирогова Алёна','Щербакова Аделина','Нестеров Борис','Коровин Максим','Андрианова Диана','Егорова София','Губанов Иван','Кузнецова София','Горшков Ярослав'],
    'class E' => ['Королева Ева','Пирогова Алёна','Щербакова Аделина','Нестеров Борис','Коровин Максим','Андрианова Диана','Егорова София','Губанов Иван','Кузнецова София','Беспалова Аделина']
];

// foreach($school as $key => $class) {
//     $arr = implode(",", $class) . "<hr>";
//     echo $arr;
//     $arr2;
//     $arr2 = explode(",",$arr);
//     echo "<pre>";
//     print_r($arr2);
//     echo "</pre>";
// }

foreach($school as $key => $value){
	$arr2 = implode(",", $school["$key"]);
	$arr99[$key] = $arr2;
}
echo "<pre>";
print_r($arr99);
echo "</pre>";
?>